Repository: Beit-Hatfutsot/wp-bh-themes
Catalog: languages/*.po
Languages: he_il

source: Certificate of Appreciation example
he_il: תעודת הוקרה לדוגמה

source: In Loving Memory Certificate example
he_il: תעודת תרומה לזכר אדם

source: Thank You Certificate example
he_il: תעודת "תודתנו" - לדוגמה

source: Certificate of Appreciation
he_il: תעודת הוקרה

source: In Loving memory of
he_il: תרומה לזכר אדם

source: Thank You
he_il: תודתנו

source: Thank you for your request!
he_il: תודה רבה על פנייתכם!

source: An invoice for your payment will be sent to your email address shortly.
he_il: חשבונית תישלח בהקדם לכתובת המייל שציינתם.

source: Payment failed
he_il: התשלום נכשל

source: Error #
he_il: שגיאה מספר

source: Wrong ID or CVV.
he_il: מספר ת.ז. או CVV שגוי.

source: Please correct the errors and submit the request again.
he_il: אנא תקנו את השגיאות ושלחו שוב את הבקשה.

source: Wrong credit card number.
he_il: מספר כרטיס אשראי שגוי.

source: Unsupported credit card.
he_il: כרטיס אשראי לא נתמך.

source: Please submit the request again using a different credit card.
he_il: אנא שלחו את הבקשה באמצעות כרטיס אשראי אחר.

source: General Error.
he_il: שגיאה כללית.

source: Transaction ID
he_il: מזהה עסקה

source: Bar Mitzvah boy Mordechai ben Ester
he_il: חתן בר המצווה מרדכי בן אסתר

source: Our beloved grandmother Bracha Cohen
he_il: סבתנו היקרה ברכה כהן ז"ל

source: To Barak Aharoni with appreciation of your good work
he_il: לברק אהרוני על פועלו

source: Newsletter
he_il: ניוזלטר

source: Load more
he_il: תמונות נוספות

source: Your Email:
he_il: כתובת מייל:

source: Email Address
he_il: כתובת מייל

source: Email address is missing or incorrect
he_il: כתובת מייל שגויה או חסרה

source: Choose Language:
he_il: בחרו שפה:

source: Please check at least one newsletter name
he_il: יש לבחור לפחות שפה אחת

source: Register
he_il: הרשמה

source: No thanks
he_il: לא תודה

source: General error, please try again later
he_il: שגיאה כללית, אנא נסו שוב מאוחר יותר

source: Registration has been failed, please try again later
he_il: הרישום נכשל, אנא נסו שנית מאוחר יותר

source: Registration was successful, thank you!
he_il: הרישום בוצע בהצלחה, תודה רבה!

source: RECENTLY<br />VIEWED
he_il: נצפו<br />לאחרונה

source: Home
he_il: דף הבית

source: Show product filters
he_il: הצג מסנני מוצרים

source: Hide product filters
he_il: הסתר מסנני מוצרים

source: Filter products
he_il: סנן מוצרים

source: <b>IMPORTANT NOTIFICATION:</b> Due to the Israeli postal office being unable to provide our customers up to date order tracking and delivery within guaranteed time range, until further notice we no longer offer regular shipping. We apologise for any inconvenience to our customers.
he_il: <b>הודעה חשובה:</b> לאור חוסר היכולת של דואר ישראל לספק ללקוחותינו משלוחים בטווח הזמן המובטח והקושי במעקב אחר חבילות וקבלת מענה לפניות, אנו נאלצים להפסיק להציע משלוח רשום רגיל. עם לקוחותינו הסליחה.

source: Checkout: Please fill your billing address and shipping address
he_il: קופה: אנא הזינו פרטים למשלוח חשבונית וכתובת למשלוח

source: Checkout: Please fill your payment details
he_il: קופה: אנא הזינו פרטי אמצעי תשלום

source: Thank you. Your order has been received
he_il: תודה רבה. הזמנתכם התקבלה בהצלחה

source: Secured Billing: Please choose your preferred billing method
he_il: אמצעי חיוב מאובטח: אנא בחרו את האמצעי המועדף עליכם

source: Most Popular
he_il: הפופולרי ביותר

source: Price: Low to High
he_il: מחיר: נמוך לגבוה

source: Price: High to Low
he_il: מחיר: גבוה לנמוך

source: Search in shop...
he_il: חיפוש בחנות...

source: Search in site...
he_il: חיפוש באתר...

source: By
he_il: על ידי

source: Comments
he_il: תגובות

source: No Records Found
he_il: לא נמצאו תוצאות

source: Return to
he_il: חזרה

source: homepage
he_il: לדף הבית

source: Amount
he_il: סכום

source: How much would you like to give? (In NIS)
he_il: כמה ברצונך לתרום?

source: Donate 100 Shekels
he_il: לתרום 100 ש"ח

source: NIS
he_il: ש"ח

source: will help expand our Jewish identity outreach program to IDF soldiers
he_il: יעזרו בהרחבת פעילות "זהות יהודית" לחיילי צה"ל

source: Donate 200 Shekels
he_il: לתרום 200 ש"ח

source: will help expand our rich database of Jewish family trees, names and places
he_il: יעזרו בהעשרת מאגרי המידע שלנו בעיקר בנושא עצי משפחה, שמות משפחה ומקומות

source: Donate 500 Shekels
he_il: לתרום 500 ש"ח

source: will go towards developing educational materials for school groups
he_il: יעזרו בפיתוח חומרים חינוכיים עבור כיתות ביה"ס

source: Donate 1000 Shekels
he_il: לתרום 1000 ש"ח

source: will help bring a group of visitors with special needs to Beit Hatfusot
he_il: יעזרו בהבאת קבוצה של מבקרים בעלי צרכים מיוחדים

source: I would like this to be a regular annual donation
he_il: אני רוצה שתרומתי תהיה שנתית

source: A gift of over 100,000 NIS will be recognized on
he_il: תרומה מעל 100,000 ש"ח תכניס אתכם אל

source: Beit Hatfutsot's central Donor's Wall
he_il: רשימת התורמים בקיר בית התפוצות

source: Tribute Gift
he_il: הוקרה

source: Print your certificate in honor, memory or support of your loved one
he_il: שלחו אלי תעודה עבור תרומה לכבוד/לזכר אדם אהוב, או כהוקרת תודה (להדפסה ביתית)

source: Tribute Type
he_il: סוג התעודה

source: Certificate Language
he_il: שפת התעודה

source: Your Text
he_il: הטקסט שלך

source: (Up to 50 characters)
he_il: (עד 50 תווים)

source: A Print version of the certificate will be sent to you, your name and date will be automatically updated.
he_il: גרסת הדפסה של התעודה תישלח אליך, שמך והתאריך יתווספו באופן אוטומטי.

source: Please select a donation amount, or enter a custom sum between 5 - 40,000 NIS.
he_il: יש לבחור את אחד מהסכומים לתרומה, או להזין סכום חופשי בין 5 ל- 40,000 ש"ח

source: Continue
he_il: המשך

source: Your Details
he_il: פרטי חיוב

source: Beit Hatfutsot uses a secure connection for online credit card transactions
he_il: בית התפוצות משתמש בחיבור בטוח עבור תשלום אונליין

source: First Name
he_il: שם פרטי

source: Last Name
he_il: שם משפחה

source: Would you like the receipt to be put in someone else's name?
he_il: האם יש צורך בשם אחר על החשבונית?

source: Name on the receipt
he_il: השם על החשבונית

source: Company
he_il: חברה

source: Country
he_il: מדינה

source: Street
he_il: שם הרחוב

source: House No.
he_il: מס' בית

source: Address - line 2
he_il: כתובת - שורה 2

source: Address line 2 (Optional)
he_il: שורת כתובת 2 (אופציונלי)

source: City
he_il: עיר

source: Postal/Zip Code
he_il: מיקוד

source: Email
he_il: דואר אלקטרוני

source: Your receipt will be sent to this address
he_il: החשבונית שלך תישלח לכתובת זו

source: Phone number
he_il: מספר טלפון

source: Or Mobile number
he_il: או סלולרי

source: I've read and accept the
he_il: קראתי ואני מסכים/מה עם

source: terms & conditions
he_il: תנאי השימוש

source: Donate
he_il: תרומה

source: Financial Information
he_il: מידע פיננסי

source: Proper Management Approval Document
he_il: אישור ניהול תקין

source: IRS public institution & article 46 Approval
he_il: אישור מס הכנסה למוסד ציבורי (סעיף 46)

source: Annual Report
he_il: דו"ח שנתי

source: Click to download the document
he_il: לחץ להורדת המסמך

source: File Unavailable
he_il: קובץ לא זמין

source: Details
he_il: פרטים

source: Payment
he_il: תשלום

source: Complete
he_il: אישור

# donation-tabs-default
source: Online
he_il: אונליין

# donation-tabs-default
source: By Check
he_il: צ'ק

# donation-tabs-default
source: Bank Transfer
he_il: העברה בנקאית

# donation-tabs-default
source: By Phone
he_il: טלפון

# donation-tabs-mobile
source: Check
he_il: צ'ק

# donation-tabs-mobile
source: Bank
he_il: העברה

# donation-tabs-mobile
source: Phone
he_il: טלפון

source: Your gift is tax deductible in Israel.
he_il: התרומה מוכרת לצרכי מס בישראל.

source: Make a tax deductible gift in the United States instead
he_il: למעבר לביצוע תרומה מוכרת לצרכי מס בארה"ב

# donation-quote
source: Deeds of giving are the very foundations of the world
he_il: לזכור את העבר, לחיות את ההווה, להאמין בעתיד

# donation-quote
source: Mishna, Pirkei Avot 1:2
he_il: אבא קובנר

source: Back to support page
he_il: בחזרה לעמוד התרומות הראשי

source: Thank You for Your Support
he_il: תודה על תרומתך

source: Donate/Payment Method
he_il: תרומה / שיטת תשלום

source: All Exhibitions
he_il: כל התערוכות

source: All Events
he_il: כל האירועים

source: All Categories
he_il: כל הקטגוריות

source: Start from
he_il: החל מתאריך

source: Purchase
he_il: לרכישה

source: Please rotate your device!
he_il: יש לסובב את המכשיר לצפייה בתוכן

source: More
he_il: מידע נוסף

source: Less
he_il: פחות מידע

source: Navigate with
he_il: ניווט באמצעות

source: Learn more
he_il: קראו עוד

source: All events
he_il: כל האירועים

source: Select a microfilm
he_il: בחירת מיקרופילם

source: Click
he_il: לחצו

source: Add
he_il: הוסף

source: to add a microfilm to the list
he_il: בכדי להוסיף מיקרופילם לרשימה

source: Town
he_il: עיר

source: Province
he_il: פרובינציה

source: Type
he_il: סוג

source: Years Covered
he_il: שנים

source: Microfilm
he_il: מיקרופילם

source: Remove
he_il: הסר

source: *Microflim
he_il: *מיקרופילם

source: Year
he_il: שנה

source: Family Name
he_il: שם משפחה

source: Given Name
he_il: שם פרטי

source: Please enter valid microfilm
he_il: יש לבחור מיקרופילם הקיים ברשימה

source: Required
he_il: שדה חובה

source: Add another microfilm
he_il: הוסף מיקרופילם

source: Your details
he_il: פרטי המזמין

source: Full Name
he_il: שם מלא

source: Institution (if applicable)
he_il: מוסד (אם יש)

source: Address
he_il: כתובת

source: Zip / Postal code
he_il: מיקוד

source: State
he_il: מדינה (ארה"ב)

source: Phone
he_il: טלפון

source: Please enter a valid email
he_il: יש להזין כתובת דוא"ל תקנית

source: Additional Phone
he_il: טלפון נוסף

source: Send
he_il: שלח

source: There were validation errors. Please check form fields.
he_il: שדות חובה לא מולאו. יש למלא את כל שדות החובה.

source: You have not picked any microfilms.
he_il: לא נבחרו מיקרופילמים.

source: You have picked invalid microfilms.
he_il: נבחרו מיקרופילמים שאינם קיימים.

source: We have expirienced a technical problem. Please try again later.
he_il: אירעה תקלה טכנית. אנא נסו שוב מאוחר יותר.

source: Form submited succesfuly. Thank you.
he_il: הטופס נשלח בהצלחה. תודה.

source: Recent Posts
he_il: פוסטים אחרונים

source: Archives
he_il: ארכיון

source: <strong>Why shop with us?</strong> There are lots of reasons. For instance,
he_il: <strong>למה לקנות אצלנו?</strong> יש הרבה סיבות. למשל,

source: And there are more
he_il: ויש עוד סיבות

source: Subscribe to Blog notifications
he_il: רישום לעדכונים שוטפים מהבלוג

source: Sort by
he_il: מיון לפי

source: Search Results
he_il: תוצאות חיפוש

source: Monthly Recommended Products
he_il: המוצרים המומלצים החודש

source: Click for more details
he_il: לחצו לפרטים נוספים

source: QTY
he_il: כמות

source: Add to cart
he_il: הוסיפו לסל

source: Overview
he_il: פרטים נוספים

source: Technical Details
he_il: פרטים טכניים

source: Weight
he_il: משקל

source: Dimensions
he_il: מידות

source: Length x Width x Height
he_il: גובה x רוחב x אורך

source: Shipment info
he_il: פרטי משלוח

source: International shipment is available, shipping cost is based on shipping location and product dimensions.
he_il: אנו מציעים משלוחים לכל העולם, עלות המשלוח מחושבת עפ"י אופן המשלוח (מהיר/רגיל), יעד ומשקל.

source: You might also like
he_il: מוצרים נוספים שיעניינו אתכם

source: Product
he_il: מוצר

source: Price
he_il: מחיר

source: Quantity
he_il: כמות

source: Quantity: %s
he_il: כמות: %s

source: No products in the cart.
he_il: לא נמצאו מוצרים בעגלה.

source: Subtotal
he_il: סכום ביניים

source: View Cart
he_il: הצג סל קניות

source: Checkout
he_il: לתשלום

source: Date:
he_il: תאריך:

source: Your order was shipped. Your order details are shown below for your reference:
he_il: הזמנתכם נשלחה. פרטי ההזמנה מופיעים להלן:

source: Order #%s
he_il: הזמנה מספר %s

source: For further questions or assistance please contact us:
he_il: לשאלות או לסיוע נוסף אנא צרו עמנו קשר:

source: Your order has been received and is now being processed. Your order details are shown below for your reference:
he_il: הזמנתכם התקבלה ומטופלת כעת. פרטי ההזמנה מופיעים להלן:

source: Billing address
he_il: כתובת חיוב

source: Shipping address
he_il: כתובת משלוח
